<template>
  <div class="page">
    <h1 class="title">{{ page.title }}</h1>
    <el-divider></el-divider>
    <p v-for="(item, i) in page.paraList" :key="i" class="para">{{ item }}</p>

    <div class="footer">
      <el-button>上一页</el-button>
      <el-button>目录</el-button>
      <el-button>下一页</el-button>
    </div>
  </div>
</template>

<script lang="ts">
import { PageEntity } from '@/core/entities';
import { defineComponent, reactive } from 'vue';

export default defineComponent({
  name: '',
  setup() {
    const page: PageEntity = reactive({ title: '', paraList: [] });

    return { page };
  },
  created() {
    this.queryPage();
  },
  methods: {
    queryPage() {
      this.page.title = '这是一个标题';
      this.page.paraList = [
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。',
        '庞威瑟这会儿虽然自以为是个牧师，可他之前是个骑士，手上不少人命，追爷看他还算顺眼，而且实际上修力八境的修为力量足够，所以这会儿能替林朔扛着。'
      ];
    }
  }
});
</script>

<style lang="scss" scoped>
.page {
  background-color: #e9faff;
  padding: 1rem;
  height: 100%;
  overflow-y: auto;

  .title {
    font-size: 20px;
    text-align: center;
    margin: 0.5rem 0;
  }

  .para {
    text-indent: 2rem;
    line-height: 1.5rem;
  }

  .footer {
    text-align: center;
  }
}

.el-divider {
  margin: 12px 0;
}
</style>
